{"data":{"site":{"siteMetadata":{"title":"Arjun's Blog","author":"Arjun Munji"}},"markdownRemark":{"id":"22aaa7b1-2595-590f-9a69-0403be363bd9","excerpt":"Well, not really a marathon, but a 10K One of my big goals for this year was to have an active lifestyle, and I decided that running a marathon would be a good…","html":"<p>Well, not really a marathon, but a 10K</p>\n<p>One of my big goals for this year was to have an active lifestyle, and I decided that running a marathon would be a good step (pun intended) in that direction. And so, on a wet Sunday in August, I participated in <strong>Airtel Hyderabad Marathon</strong> — the biggest annual running event in the city — in the 10K category.</p>\n<h2>False Starts</h2>\n<p>I had originally planned on running a Half marathon. As soon as the dates were announced, I made an overly optimistic (given my sedentary lifestyle) workout plan that included a week of warm-up runs, 10 weeks of training, and new shoes for the big day.</p>\n<p>I used Runkeeper<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup> to track my runs and form the very first run, I struggled to get a good pace. As we often do, I dismissed it as teething problems, and kept pushing though the pain for a week. By the end of the week, I had severe pain in my shinbones — even simply stomping my feet hurt!</p>\n<p>And so I decided to take some time off to heal my legs, thinking that perhaps I’d exerted myself too much too soon. A week into my 10 week training, I was forced to take a month’s break.</p>\n<p>Then one day, I fell down the stairs. Yup. Slipped on soap water and crashed hard on my back. Got bruises all along my back, thigh and butt. Thankfully, nothing happened to my neck or head. </p>\n<p>Naturally, I headed to a doctor and was told that it wasn’t serious and everything would heal in good time. It was there that I found out that I had Vitamin D3 deficiency and my joints were to some degree <em><a href=\"https://en.wikipedia.org/wiki/Hypermobility_(joints)\">hypermobile</a></em>. This meant that I had to be careful when I exercise my joints, especially my knees.</p>\n<p>However, the doctor encouraged me to take part in the marathon after completing my physiotherapy.</p>\n<h2>Ready, Set, Go!</h2>\n<p>By this point I knew that I couldn’t possibly take part in the Half Marathon with virtually zero training, so I registered to take part in the 10K event. And then I didn’t run even once until race day.</p>\n<p>Armed with Gatorade, glucose pills, and creeping anxiety, I reached my starting point at Hitex Exhibition Center, along with 8,000 others taking part in the 10K leg of the marathon.</p>\n<p>The run itself was brutal, exhausting, but ultimately cathartic.</p>\n<p>I managed to not stop at any point, and just keep running or walking or even just moving. There were multiple points along the route where volunteers were handing out water, bananas, sliced lemons(?!), glucose powder, electrolytes etc. They were cheering and hooting to encourage runners to keep moving. </p>\n<p>The best cheer squad by far was a row of little schoolchildren who were singing, clapping, and high-fiving the runners. They put a smile on everyone’s faces. </p>\n<p>I could barely walk by the end, but all I knew is that I had to complete it, if only to prove to myself that I could. I stumbled my way into the finish line and collected my medal, feeling relieved at last. The official time was 1:21:16, which is “not great, but not terrible”<sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup>. ¯\\_(ツ)_/¯</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-2\">\n<p>Cherbyl </p>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-1\">\n<p> <a href=\"https://runkeeper.com/\">https://runkeeper.com/</a>: The voice assisted run training is pretty helpful. Not sure if it’s worth the ~₹620 weekly fee though.</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","frontmatter":{"title":"Running A Marathon","date":"December 09, 2019","tags":["miscellaneous"]}}},"pageContext":{"slug":"/running-a-marathon/","previous":{"fields":{"slug":"/things-i-want-to-learn/"},"frontmatter":{"title":"Things I Want to Learn","tags":["learning","programming"],"date":"April 24, 2019"},"excerpt":"In no particular order (maybe there should be one? 🤔), here is a list of things I want to learn: I will try and update this list as often…"},"next":null}}