{"data":{"site":{"siteMetadata":{"title":"Arjun's Blog","author":"Arjun Munji"}},"markdownRemark":{"id":"037fded0-6b57-5cf4-8944-e3e1b28aae55","excerpt":"I’ve always wanted to do an ‘year in review’ kinda post to help me reflect upon the year passed and see how it has affected me.\nAt least it gives me a moment to…","html":"<p>I’ve always wanted to do an ‘year in review’ kinda post to help me reflect upon the year passed and see how it has affected me.\nAt least it gives me a moment to appreciate all the good that has happened in the past year, and hopefully learn from the mistakes I’ve made.</p>\n<hr>\n<h2>Work</h2>\n<p>At the end of 2017, I joined MedleyMed\n<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup>, an e-commerce company  as a full-stack product engineer. It has been a great learning curve, given that it is my first real job and that I had to learn Python and Django, the stack the product is based on, from scratch.</p>\n<p>I immedidately fell in love with Python — it is a well designed, easy to understand language that is so flexible that a noob developer such as myself can start building apps in no time, and yet powerful enough to be used to solve complex scientific problems. Django felt quirky in the beginning but as I started using it, I realised how mature and fully featured the framework and its ecosystem is. Apart from these two, I also dipped my toes into PostgreSQL 🤞, wrangled with Git 💪, wept over Vim 😫, made peace with Linux 😇, and mastered VSCode 🤓. </p>\n<p>Of course, writing code is only part of my job. I also had to sit through countless meetings, discussions and demos. I learned how important it is to plan out your work and strategy before writing even a single line of code. I’ve missed a good number of deadlines thanks to my poor planning. Although some of it can be attributed to my sub-par debugging and backtracking skills. It is something I want to fix in 2019.</p>\n<p>My coworkers have been super supportive and helpful throughout and the structure of our team is such that often times we solve problems in collaborative, not-quite-pair-programming kinda ways. I also got to mentor a new member of the team for a few weeks. It was super fun, although I feel like I could’ve beeen more helpful and approachable to my mentee<sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup>.</p>\n<hr>\n<h2>Personal</h2>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p> The product I work on is <a href=\"https://biz.medleymed.com\">https://biz.medleymed.com</a>. It aims to solve really complex logistical and supply-chain problems in the B2B pharmaceutical industry.</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p> I’m still not sure how I feel about this.. I tried to strike a balance between hands off and spoon feeding, just letting them figure stuff out from clues and pointers. But I do feel guilty idk why</p>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","frontmatter":{"title":"2018 In Review","date":"January 05, 2019"}}},"pageContext":{"slug":"/2018-in-review/","previous":{"fields":{"slug":"/how-i-built-sketch/"},"frontmatter":{"title":"How I Built Sketch"}},"next":null}}